Enterprise_Serivces/Cert/SilverGroup1/CSLProductService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/product/contracts/2010/05/IProductService/GetProduct</wsa:Action><wsa:MessageID>uuid:d1172285-e590-41c0-b28d-ea13f522a01a</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslproductserviceqa1.testgs.pvt/ProductService.svc</wsa:To></soap:Header><soap:Body><GetProduct xmlns="http://www.gamestop.com/services/csl/product/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><ProductID xmlns="http://www.gamestop.com/services/csl/product/messages/2010/08">10</ProductID><Sku xmlns="http://www.gamestop.com/services/csl/product/messages/2010/08">181060</Sku></request></GetProduct></soap:Body></soap:Envelope>